The choice of rule for measuring the diameter.
  Namespace:   Autodesk.Revit.DB.Structure
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public RebarShapeArcReferenceType ArcReferenceType { get; }
  Visual Basic
Public ReadOnly Property ArcReferenceType As RebarShapeArcReferenceType
	Get
  Visual C++
public:
property RebarShapeArcReferenceType ArcReferenceType {
	RebarShapeArcReferenceType get ();
}
 See Also
  RebarShapeConstraintDiameter Class
  Autodesk.Revit.DB.Structure Namespace